import React from 'react'

import Footer from '@/components/layout/footer'
import Header from '@/components/layout/header'

const PrivacyContainer: React.FC = () => {
  return (
    <div>
      <Header dark={false} />

      <div className="pt-[100px] md:pt-[150px] pb-[250px] p-2 md:p-0">
        <div className="max-w-5xl mx-auto border rounded-xl p-4 md:p-8">
          <h1 className="text-3xl font-bold text-center">حریم خصوصی در آی‌نویس</h1>

          <div className="mt-10">
            <ul className="space-y-8">
              <li>
                <p className="font-bold">پذیرش شرایط</p>

                <p className="mt-2">
                  این شرایط خدمات یک توافق قانونی بین شما و آی‌نویس است. اگر با هر بخشی از این قوانین موافقت ندارید،
                  نباید از خدمات ما استفاده کنید.
                </p>
              </li>
              <li>
                <p className="font-bold">توضیحات خدمات</p>

                <p className="mt-2">
                  آی‌نویس یک مجموعه کامل از ابزارهای هوش مصنوعی را به کاربران ارائه می‌دهد. خدمات ما شامل امکانات متنوعی
                  از ابزارهای هوش مصنوعی مانند پردازش زبان طبیعی، تولید تصاویر، یادگیری ماشین و تشخیص گفتار است.
                </p>
              </li>
              <li>
                <p className="font-bold">استفاده از خدمات ما</p>

                <p className="mt-2">
                  با استفاده از خدمات ما، شما موافقت می‌کنید که با این متن و هرگونه سیاست، رهنمود یا دستورالعملی که توسط
                  آی‌نویس منتشر شده است، رعایت کنید. شما نباید از خدمات ما برای هرگونه موارد غیرقانونی، غیراخلاقی یا
                  بدون مجوز استفاده کنید.
                </p>
              </li>
              <li>
                <p className="font-bold">هزینه‌ها و پرداخت</p>

                <p className="mt-2">
                  آی‌نویس یک طرح رایگان با امکانات محدود و طرح‌های پولی با امکانات پیشرفته‌تر ارائه می‌دهد. آی‌نویس حق
                  تغییر هزینه‌ها برای خدمات را در هر زمان دارد. تمام هزینه‌ها بدون هرگونه مالیات قابل اعمال و شما مسئول
                  پرداخت تمام مالیات‌های قابل اعمال هستید.
                </p>
              </li>
              <li>
                <p className="font-bold">بازگشت وجه</p>

                <p className="mt-2">
                  اگر از نرم‌افزار ما راضی نیستید، می‌توانید در ۱۴ روز از پرداخت اول خود ما را در جریان قرار دهید و ما
                  به عنوان گارانتی 14 روز بازگشت وجه، وجه کامل را به شما بازپرداخت خواهیم کرد. لطفاً توجه داشته باشید:
                  این گارانتی فقط برای پرداخت‌های اولیه اعمال می‌شود، نه برای تمدید خودکار یا معاملات ویژه. ما همچنین حق
                  رد بازپرداخت‌ها را در صورت مشکوک بودن به سوء استفاده از سیستم مانند ارتقاء و استفاده از نسل‌ها به صورت
                  اسپمی و سپس درخواست بازپرداخت را داریم.
                </p>
              </li>
              <li>
                <p className="font-bold">انکار ضمانت</p>

                <p className="mt-2">
                  آی‌نویس خدمات خود را "به شکلی که هست"، بدون هرگونه ضمانت یا نمایندگی، صریح یا ضمنی ارائه می‌دهد.
                  آی‌نویس ضمانت یا اظهار نمی‌کند که خدمات ما نیازهای شما را برآورده خواهد کرد، بدون خطا یا بدون وقفه
                  خواهد بود.
                </p>
              </li>
              <li>
                <p className="font-bold">محدودیت مسئولیت</p>

                <p className="mt-2">
                  آی‌نویس مسئول هیچ گونه خسارت مستقیم، غیرمستقیم، اتفاقی، ویژه یا جانبی ناشی از یا به ارتباط با خدمات ما
                  نیست، حتی اگر آی‌نویس از احتمال وقوع چنین خساراتی آگاه باشد.
                </p>
              </li>
              <li>
                <p className="font-bold">توضیحات خدمات</p>

                <p className="mt-2">
                  آی‌نویس یک مجموعه کامل از ابزارهای هوش مصنوعی را به کاربران ارائه می‌دهد. خدمات ما شامل امکانات متنوعی
                  از ابزارهای هوش مصنوعی مانند پردازش زبان طبیعی، تولید تصاویر، یادگیری ماشین و تشخیص گفتار است.
                </p>
              </li>
              <li>
                <p className="font-bold">جبران خسارت</p>

                <p className="mt-2">
                  شما موافقت می‌کنید که آی‌نویس را در مقابل هر گونه ادعا یا درخواست، از جمله هزینه‌های معقول وکلای شما،
                  بابت استفاده از خدمات ما، تخلف از این متن یا نقض هر گونه قانون یا مقرره، جبران دهید.
                </p>
              </li>
            </ul>
          </div>
        </div>
      </div>

      <Footer />
    </div>
  )
}

export default PrivacyContainer
